Repository: KiYouJyo/ApiMonitor
Catalog: Strings/*/Resources.resw
Source language: en_us
Languages: ja_jp, zh_cn

# Home.AccountSummary
source: {0} accounts · {1} low balance · {2} query failed
ja_jp: 合計 {0} アカウント · 残高不足 {1} · 照会失敗 {2}
zh_cn: 共 {0} 个账户 · 低余额 {1} · 查询失败 {2}

# Home.FilterAllProviders
source: All providers
ja_jp: すべての Provider
zh_cn: 全部 Provider

# Home.FilterAllStatus
source: All statuses
ja_jp: すべての状態
zh_cn: 全部状态

# Home.StatusNormal
source: Normal
ja_jp: 正常
zh_cn: 正常

# Home.StatusLow
source: Low balance
ja_jp: 残高不足
zh_cn: 低余额

# Home.StatusUnknown
source: Unknown
ja_jp: 不明
zh_cn: 未知

# Home.StatusFailed
source: Failed
ja_jp: 失敗
zh_cn: 失败

# Home.AutoRefreshOn
source: Auto refresh: on
ja_jp: 自動更新：オン
zh_cn: 自动刷新：已开启

# Home.AutoRefreshOff
source: Auto refresh: off
ja_jp: 自動更新：オフ
zh_cn: 自动刷新：已关闭

# Home.RefreshInterval
source: Refresh interval: {0} minutes
ja_jp: 更新間隔：{0} 分
zh_cn: 刷新间隔：{0} 分钟

# Home.NextRefreshOff
source: Next refresh: auto refresh off
ja_jp: 次回更新：自動更新オフ
zh_cn: 下次刷新：自动刷新已关闭

# Home.NextRefreshAt
source: Next refresh: {0}
ja_jp: 次回更新：{0}
zh_cn: 下次刷新：{0}

# Home.NextRefreshNever
source: Next refresh: not queried yet
ja_jp: 次回更新：未照会
zh_cn: 下次刷新：尚未查询

# Home.LastSuccessLine
source: Last successful update: {0}
ja_jp: 最終更新成功：{0}
zh_cn: 最近成功更新：{0}

# Home.NotAvailable
source: Unavailable
ja_jp: 利用不可
zh_cn: 不可用

# Home.NoData
source: No balance data yet
ja_jp: 残高データはまだありません
zh_cn: 尚无余额数据

# Home.NotificationsOn
source: Notifications: on
ja_jp: 通知：オン
zh_cn: 通知：开启

# Home.NotificationsOff
source: Notifications: off
ja_jp: 通知：オフ
zh_cn: 通知：关闭

# Home.NotificationsInherit
source: Notifications: inherit global
ja_jp: 通知：グローバルに従う
zh_cn: 通知：继承全局

# Home.SnoozeUntil
source: Alerts paused until {0}
ja_jp: {0} までアラート一時停止
zh_cn: 暂停提醒至 {0}

# Insights.Range7Days
source: Last 7 days
ja_jp: 直近 7 日間
zh_cn: 最近 7 天

# Insights.Range30Days
source: Last 30 days
ja_jp: 直近 30 日間
zh_cn: 最近 30 天

# Insights.Range90Days
source: Last 90 days
ja_jp: 直近 90 日間
zh_cn: 最近 90 天

# Insights.RangeAll
source: All available history
ja_jp: 全履歴
zh_cn: 全部可用历史

# Insights.FirstValue
source: First value
ja_jp: 最初の値
zh_cn: 首个值

# Insights.LatestValue
source: Latest value
ja_jp: 最新値
zh_cn: 最新值

# Insights.MinimumValue
source: Minimum value
ja_jp: 最小値
zh_cn: 最低值

# Insights.MaximumValue
source: Maximum value
ja_jp: 最大値
zh_cn: 最高值

# Insights.Estimated
source: Estimated
ja_jp: 推定値
zh_cn: 估算值

# Insights.EstimateDisclaimer
source: Calculated from local history; actual consumption may differ.
ja_jp: ローカルの履歴に基づいて計算された推定値です。実際の消費量とは異なる場合があります。
zh_cn: 基于本机历史记录计算，实际消耗可能不同。

# Insights.ExportCsvDone
source: CSV exported
ja_jp: CSV をエクスポートしました
zh_cn: CSV 已导出

# Insights.EmptyState
source: Not enough history yet. Trends will appear here after a balance refresh succeeds.
ja_jp: 履歴データがまだ不足しています。残高の更新に成功すると、ここに傾向が表示されます。
zh_cn: 尚无足够的历史数据。余额成功刷新后，趋势将在这里显示。

# Insights.NoAccount
source: No accounts yet. Add an account on the Home page first.
ja_jp: アカウントがまだありません。まずホームでアカウントを追加してください。
zh_cn: 尚未添加账户。请先在主页添加账户。

# Insights.NotEnoughData
source: Not enough data
ja_jp: データ不足
zh_cn: 数据不足

# Insights.NoConsumption
source: No consumption observed yet
ja_jp: 消費がまだ観測されていません
zh_cn: 尚未观察到消耗

# Insights.RecentTopUp
source: Mostly top-ups or resets recently
ja_jp: 最近は主にチャージまたはリセット
zh_cn: 最近主要为充值或重置

# Insights.UnsupportedMetric
source: Metric does not support prediction
ja_jp: この指標は予測に対応していません
zh_cn: 指标不支持预测

# Insights.UnknownCurrentValue
source: Current value unknown
ja_jp: 現在値が不明
zh_cn: 当前值未知

# Insights.TimeSpanTooShort
source: Time span too short
ja_jp: 期間が短すぎます
zh_cn: 时间跨度不足

# Insights.Unlimited
source: Unlimited
ja_jp: 無制限
zh_cn: 无限额度

# Insights.NotApplicable
source: Not applicable
ja_jp: 該当なし
zh_cn: 不适用

# Insights.ChartSummary
source: {0} {1} trend: {2} data points, {3} to {4}, minimum {5}, maximum {6}
ja_jp: {0} の {1} 傾向：データ点 {2} 個、{3} から {4}、最小 {5}、最大 {6}
zh_cn: {0} 的 {1} 趋势图：{2} 个数据点，{3} 至 {4}，最低 {5}，最高 {6}

# Insights.ChartNotEnoughData
source: Not enough {1} history for {0} to draw a trend.
ja_jp: {0} の {1} 履歴が不足しているため、傾向を描画できません。
zh_cn: {0} 的 {1} 历史数据不足，无法绘制趋势。

# Insights.HideHistory
source: Hide history table
ja_jp: 履歴テーブルを非表示
zh_cn: 隐藏历史数据表

# Insights.HistoryTable
source: History table
ja_jp: 履歴テーブル
zh_cn: 历史数据表

# Insights.SourceManual
source: Manual
ja_jp: 手動
zh_cn: 手动

# Insights.SourceAutomatic
source: Automatic
ja_jp: 自動
zh_cn: 自动

# Insights.UnknownValue
source: Unknown
ja_jp: 不明
zh_cn: 未知

# Insights.Loading
source: Loading history…
ja_jp: 履歴を読み込んでいます…
zh_cn: 正在加载历史数据…

# Insights.LoadError
source: Failed to load history. Please try again later.
ja_jp: 履歴の読み込みに失敗しました。後でもう一度お試しください。
zh_cn: 加载历史数据失败，请稍后重试。

# Settings.CloseHide
source: Hide to notification area
ja_jp: 通知領域に隠す
zh_cn: 隐藏到通知区域

# Settings.CloseExit
source: Exit ApiMonitor
ja_jp: ApiMonitor を終了
zh_cn: 退出 ApiMonitor

# Settings.StartWithWindowsDescription
source: When enabled, ApiMonitor stays in the notification area at sign-in and does not open the main window automatically.
ja_jp: 有効にすると、サインイン時に通知領域へ常駐し、メインウィンドウは自動的に開きません。
zh_cn: 启用后，ApiMonitor 将在登录时驻留通知区域，不自动弹出主窗口。

# Settings.On
source: On
ja_jp: オン
zh_cn: 开启

# Settings.Off
source: Off
ja_jp: オフ
zh_cn: 关闭

# Settings.ThemeSystem
source: System
ja_jp: システムに従う
zh_cn: 跟随系统

# Settings.ThemeLight
source: Light
ja_jp: ライト
zh_cn: 浅色

# Settings.ThemeDark
source: Dark
ja_jp: ダーク
zh_cn: 深色

# Settings.LanguageSystem
source: System
ja_jp: システムに従う
zh_cn: 跟随系统

# Settings.LanguageRestartRequired
source: The language change will take effect after the app restarts. Restart now?
ja_jp: 言語の変更はアプリの再起動後に有効になります。今すぐ再起動しますか？
zh_cn: 语言更改将在重启应用后生效。是否立即重启？

# Settings.RestartNow
source: Restart now
ja_jp: 今すぐ再起動
zh_cn: 立即重启

# Settings.Later
source: Later
ja_jp: 後で
zh_cn: 稍后

# Settings.RestartFailed
source: Automatic restart failed. Please exit and start the app manually.
ja_jp: 自動再起動に失敗しました。アプリを手動で終了してから再起動してください。
zh_cn: 无法自动重启，请手动退出后再启动应用。

# Settings.BackupDescription
source: The portable backup contains account metadata, non-sensitive provider settings, balance history, thresholds, and settings. It never contains API keys or credentials.
ja_jp: ポータブルバックアップには、アカウントメタデータ、Provider の非機密設定、残高履歴、しきい値、設定が含まれます。API キーや資格情報は一切含まれません。
zh_cn: 便携备份包含账户元数据、Provider 非敏感设置、余额历史、阈值与设置；不包含 API Key 或凭据。

# About.DisplayVersion
source: Version: v{0}
ja_jp: バージョン：v{0}
zh_cn: 版本：v{0}

# About.PackageVersion
source: Package version: {0}
ja_jp: パッケージバージョン：{0}
zh_cn: 包版本：{0}

# About.Architecture
source: Architecture: {0}
ja_jp: アーキテクチャ：{0}
zh_cn: 架构：{0}

# About.PackageIdentity
source: Package Identity: {0}
ja_jp: パッケージ ID：{0}

# About.Publisher
source: Publisher: {0}
ja_jp: 発行元：{0}
zh_cn: 发布者：{0}

# About.PrivacyItemCredentialLocker
source: All credentials (API keys, secrets, tokens) are stored in the Windows Credential Locker.
ja_jp: すべての資格情報（API キー、シークレット、トークン）は Windows Credential Locker に保存されます。

# About.PrivacyItemLocalData
source: Balances, credits, service health, history, and settings are stored only locally.
ja_jp: 残高・クレジット・サービス健全性・履歴・設定はローカルのみに保存されます。

# About.PrivacyItemNoCloud
source: The app has no developer cloud servers.
ja_jp: 開発者向けクラウドサーバーはありません。
zh_cn: 应用没有开发者云端服务器。

# About.PrivacyItemNoTelemetry
source: No telemetry and no ads.
ja_jp: テレメトリも広告もありません。
zh_cn: 没有遥测和广告。

# About.PrivacyItemLocalNotifications
source: Notifications are generated locally.
ja_jp: 通知はローカルで生成されます。
zh_cn: 通知由本机生成。

# About.PrivacyItemBackupNoSecrets
source: Portable backups never contain API keys.
ja_jp: ポータブルバックアップに API キーは含まれません。
zh_cn: 便携备份不包含 API Key。

# About.CheckingUpdates
source: Checking for updates…
ja_jp: 更新を確認しています…
zh_cn: 正在检查更新…

# About.UpToDate
source: You are up to date
ja_jp: 最新バージョンです
zh_cn: 已是最新版本

# About.UpdateAvailable
source: A new version v{0} is available
ja_jp: 新しいバージョン v{0} があります
zh_cn: 发现新版本 v{0}

# About.DevVersionNewer
source: You are running a newer development version
ja_jp: より新しい開発バージョンを実行しています
zh_cn: 当前为较新的开发版本

# About.UpdateCheckFailed
source: Update check failed: {0}
ja_jp: 更新の確認に失敗しました：{0}
zh_cn: 检查更新失败：{0}

# About.DiagnosticsCopied
source: Diagnostics copied to clipboard
ja_jp: 診断情報をクリップボードにコピーしました
zh_cn: 诊断信息已复制到剪贴板

# About.LinkLaunchFailed
source: Unable to open the link. Please try again later.
ja_jp: リンクを開けませんでした。後でもう一度お試しください。
zh_cn: 无法打开链接，请稍后重试。

# About.CurrentLanguage
source: Current UI language: {0}
ja_jp: 現在の UI 言語：{0}
zh_cn: 当前 UI 语言：{0}

# About.CurrentTheme
source: Current theme: {0}
ja_jp: 現在のテーマ：{0}
zh_cn: 当前主题：{0}

# About.ThemeSystem
source: System
ja_jp: システムに従う
zh_cn: 跟随系统

# About.ThemeLight
source: Light
ja_jp: ライト
zh_cn: 浅色

# About.ThemeDark
source: Dark
ja_jp: ダーク
zh_cn: 深色

# Common.Cancel
source: Cancel
ja_jp: キャンセル
zh_cn: 取消

# Common.Close
source: Close
ja_jp: 閉じる
zh_cn: 关闭

# Common.Open
source: Open
ja_jp: 開く
zh_cn: 打开

# Common.Save
source: Save
ja_jp: 保存
zh_cn: 保存

# Common.Delete
source: Delete
ja_jp: 削除
zh_cn: 删除

# Common.Error
source: Error
ja_jp: エラー
zh_cn: 错误

# Common.Warning
source: Warning
ja_jp: 警告
zh_cn: 警告

# Common.Success
source: Success
ja_jp: 成功
zh_cn: 成功

# Common.Failed
source: Failed
ja_jp: 失敗
zh_cn: 失败

# Common.Retry
source: Retry
ja_jp: 再試行
zh_cn: 重试

# Common.Unknown
source: Unknown
ja_jp: 不明
zh_cn: 未知

# Common.Yes
source: Yes
ja_jp: はい
zh_cn: 是

# Common.No
source: No
ja_jp: いいえ
zh_cn: 否

# Insights.Title.Text
source: Data Insights
ja_jp: データ分析
zh_cn: 数据洞察

# Insights.Subtitle.Text
source: Trends and estimates are calculated from local history and may differ from actual consumption.
ja_jp: 傾向と推定はローカルの履歴に基づいて計算されるため、実際の消費量とは異なる場合があります。
zh_cn: 基于本机历史记录计算的趋势与估算，实际消耗可能不同。

# Insights.Account.Text
source: Account
ja_jp: アカウント
zh_cn: 账户

# Insights.Metric.Text
source: Metric
ja_jp: 指標
zh_cn: 指标

# Insights.TimeRange.Text
source: Time range
ja_jp: 期間
zh_cn: 时间范围

# Insights.ExportCsv.Content
source: Export current history as CSV
ja_jp: 現在の履歴を CSV としてエクスポート
zh_cn: 导出当前历史为 CSV

# Insights.CurrentValue.Text
source: Current value
ja_jp: 現在値
zh_cn: 当前值

# Insights.ChangeInRange.Text
source: Change in range
ja_jp: 期間内の変化
zh_cn: 区间变化

# Insights.DailyConsumption.Text
source: Estimated daily consumption
ja_jp: 1 日あたり消費量（推定）
zh_cn: 每日消耗估算

# Insights.EstimatedDaysLeft.Text
source: Estimated days left
ja_jp: 推定利用可能日数
zh_cn: 预计可用天数

# Insights.ShowHistory.Content
source: Show history table
ja_jp: 履歴テーブルを表示
zh_cn: 显示历史数据表

# Insights.ColTime.Text
source: Time
ja_jp: 時間
zh_cn: 时间

# Insights.ColAccount.Text
source: Account
ja_jp: アカウント
zh_cn: 账户

# Insights.ColMetric.Text
source: Metric
ja_jp: 指標
zh_cn: 指标

# Insights.ColValue.Text
source: Value
ja_jp: 値
zh_cn: 数值

# Insights.ColUnit.Text
source: Unit
ja_jp: 単位
zh_cn: 单位

# Insights.ColSource.Text
source: Query source
ja_jp: 照会元
zh_cn: 查询来源

# About.Title.Text
source: About
ja_jp: このアプリについて
zh_cn: 关于

# About.CapabilitiesTitle.Text
source: Capabilities
ja_jp: 現在の機能
zh_cn: 当前能力

# About.PrivacyTitle.Text
source: Privacy and security summary
ja_jp: プライバシーとセキュリティの概要
zh_cn: 隐私与安全摘要

# About.LinksTitle.Text
source: Project links
ja_jp: プロジェクトリンク
zh_cn: 项目链接

# About.LinkRepository.Content
source: GitHub repository
ja_jp: GitHub リポジトリ
zh_cn: GitHub 仓库

# About.LinkIssues.Content
source: Report an issue
ja_jp: 問題を報告
zh_cn: 提交问题

# About.LinkPrivacy.Content
source: Privacy policy
ja_jp: プライバシーポリシー
zh_cn: 隐私政策

# About.LinkSecurity.Content
source: Security policy
ja_jp: セキュリティポリシー
zh_cn: 安全政策

# About.LinkSupport.Content
source: Support documentation
ja_jp: サポートドキュメント
zh_cn: 支持文档

# About.LinkThirdParty.Content
source: Third-party notices
ja_jp: サードパーティ製の声明
zh_cn: 第三方声明

# About.OpenLocalDocuments.Text
source: Local documents
ja_jp: ローカルドキュメント
zh_cn: 本地文档

# About.DocsPrivacy.Content
source: Privacy policy
ja_jp: プライバシーポリシー
zh_cn: 隐私政策

# About.DocsThirdParty.Content
source: Third-party notices
ja_jp: サードパーティ製の声明
zh_cn: 第三方声明

# About.CheckUpdates.Content
source: Check for updates
ja_jp: 更新を確認
zh_cn: 检查更新

# About.CopyDiagnostics.Content
source: Copy diagnostics
ja_jp: 診断情報をコピー
zh_cn: 复制诊断信息

# About.OpenDataFolder.Content
source: Open local data folder
ja_jp: ローカルデータフォルダーを開く
zh_cn: 打开本地数据文件夹

# About.Tagline.Text
source: Monitor API balances, credits, credential status, and map/GIS service health locally
ja_jp: API 残高・クレジット・認証情報・地図/GIS サービスの健全性をローカルで監視

# About.CapabilitiesSummary.Text
source: 11 providers (5 AI balance + 6 map/GIS health), multi-account management, separate balance and health metrics; auto refresh, notification area, local alerts, and data insights.
ja_jp: 11 の Provider（AI 残高 5 + 地図/GIS 健全性 6）、複数アカウント管理、残高と健全性指標を分離。自動更新、通知領域、ローカル通知、データ分析に対応。

# About.LocalDocsDescription.Text
source: Privacy policy, MIT License, and third-party notices are bundled with the app and viewable offline.
ja_jp: プライバシーポリシー、MIT License、サードパーティ製の声明はアプリに同梱され、オフラインで閲覧できます。
zh_cn: 隐私政策、MIT License 与第三方声明随应用打包，可离线查看。

# About.UpdateSectionTitle.Text
source: Updates
ja_jp: 更新
zh_cn: 更新

# About.UpdateDescription.Text
source: Update checks access GitHub only when you click; after finding a new version you decide whether to download and install—the app never auto-downloads or installs.
ja_jp: 更新の確認はクリック時のみ GitHub にアクセスします。新しいバージョンが見つかっても、ダウンロード・インストールはユーザーが判断します。
zh_cn: 检查更新只在点击时访问 GitHub；发现新版本后由你决定是否下载安装，应用不会自动下载或安装。

# About.OpenReleasePage.Content
source: Open release page
ja_jp: リリースページを開く
zh_cn: 打开发布页

# About.DiagnosticsTitle.Text
source: Diagnostics
ja_jp: 診断情報
zh_cn: 诊断信息

# About.DiagnosticsDescription.Text
source: Copies non-sensitive diagnostics (version, architecture, provider list, account count, etc.) for troubleshooting; never contains API keys, balances, usernames, or local paths.
ja_jp: 非機密の診断情報（バージョン、アーキテクチャ、Provider 一覧、アカウント数など）をコピーしてトラブルシューティングに使用します。API キー、残高、ユーザー名、ローカルパスは含まれません。
zh_cn: 复制非敏感诊断信息（版本、架构、Provider 列表、账户数量等），用于排查问题；不包含 API Key、余额、用户名或本地路径。

# About.LocalDataTitle.Text
source: Local data
ja_jp: ローカルデータ
zh_cn: 本地数据

# About.LocalDataDescription.Text
source: Opens only the current Package LocalState (the directory holding accounts, history, and settings).
ja_jp: 現在の Package LocalState（アカウント、履歴、設定のあるディレクトリ）のみを開きます。
zh_cn: 只打开当前 Package LocalState（账户、历史与设置所在目录）。

# Nav.Home.Content
source: Home
ja_jp: ホーム
zh_cn: 主页

# Nav.Insights.Content
source: Insights
ja_jp: データ分析
zh_cn: 数据洞察

# Nav.Settings.Content
source: Settings
ja_jp: 設定
zh_cn: 设置

# Nav.About.Content
source: About
ja_jp: このアプリについて
zh_cn: 关于

# Tray.OpenMainWindow
source: Open ApiMonitor
ja_jp: ApiMonitor を開く
zh_cn: 打开 ApiMonitor

# Tray.OpenFloatingWindow
source: Open floating window
ja_jp: フローティングウィンドウを開く

# Tray.CloseFloatingWindow
source: Close floating window
ja_jp: フローティングウィンドウを閉じる

# Tray.RefreshAll
source: Refresh all accounts
ja_jp: すべてのアカウントを更新
zh_cn: 刷新全部账户

# Tray.StartWithWindows
source: Start when I sign in
ja_jp: サインイン時に起動
zh_cn: 登录时启动

# Tray.ExitApplication
source: Exit ApiMonitor
ja_jp: ApiMonitor を終了
zh_cn: 退出 ApiMonitor

# Notification.OpenAccount
source: Open account
ja_jp: アカウントを開く
zh_cn: 打开账户

# Notification.Dismiss
source: Dismiss
ja_jp: 閉じる
zh_cn: 关闭

# Notification.LowBalanceTitle
source: {0} balance is low
ja_jp: {0} の残高が不足しています
zh_cn: {0} 余额不足

# Home.SetAsFloatingWindow.Content
source: Set as floating window
ja_jp: フローティングウィンドウに設定

# Home.AddAccount.Content
source: Add account
ja_jp: アカウントを追加
zh_cn: 添加账户

# Home.RefreshAll.Content
source: Refresh all accounts
ja_jp: すべてのアカウントを更新
zh_cn: 刷新全部账户

# Home.AccountOverview.Text
source: Account overview
ja_jp: アカウント概要
zh_cn: 账户概览

# Home.FilterStatus.Text
source: Status
ja_jp: 状態
zh_cn: 状态

# Home.Refresh.Content
source: Refresh
ja_jp: 更新
zh_cn: 刷新

# Home.Edit.Content
source: Edit
ja_jp: 編集
zh_cn: 编辑

# Home.ViewTrends.Content
source: View trends
ja_jp: 傾向を見る
zh_cn: 查看趋势

# Home.CopyKey.Content
source: Copy key
ja_jp: キーをコピー
zh_cn: 复制密钥

# Home.History.Content
source: History
ja_jp: 履歴
zh_cn: 历史记录

# Home.Delete.Content
source: Delete
ja_jp: 削除
zh_cn: 删除

# Home.EmptyTitle.Text
source: No API accounts yet
ja_jp: API アカウントがまだありません
zh_cn: 尚未添加 API 账户

# Home.AddFirstAccount.Content
source: Add your first account
ja_jp: 最初のアカウントを追加
zh_cn: 添加第一个账户

# Home.Loading.Text
source: Loading local data…
ja_jp: ローカルデータを読み込んでいます…
zh_cn: 正在加载本地数据…

# Home.PrivacyTitle.Text
source: Privacy note
ja_jp: プライバシーについて
zh_cn: 隐私说明

# Home.EmptyMessage.Text
source: Add a DeepSeek or OpenRouter account to query balances, record history, and set low-balance alerts.
ja_jp: DeepSeek または OpenRouter のアカウントを追加すると、残高の照会・履歴の記録・残高不足アラートの設定ができます。
zh_cn: 添加 DeepSeek 或 OpenRouter 账户后，即可查询余额、记录历史并设置低余额提醒。

# Home.PrivacyMessage.Message
source: API keys are stored in the Windows Credential Locker and are only used to call the corresponding provider official API; plain configuration and balance snapshots are stored only in the local app data directory.
ja_jp: API キーは Windows の資格情報ロッカー（Credential Locker）に保存され、対応する Provider の公式 API への要求にのみ使用されます。通常の設定と残高スナップショットはローカルのアプリデータのみに保存されます。
zh_cn: API Key 保存在 Windows 安全凭据存储（Credential Locker）中，只用于请求对应 Provider 的官方接口；普通配置和余额快照仅保存在本机应用数据目录。

# Settings.Title.Text
source: Settings
ja_jp: 設定
zh_cn: 设置

# Settings.TraySection.Text
source: Notification area and startup
ja_jp: 通知領域と起動
zh_cn: 通知区域与启动

# Settings.TrayDescription.Text
source: After hiding to the notification area, automatic balance refresh keeps running. Only "Exit ApiMonitor" fully quits the app.
ja_jp: 通知領域に隠した後も、残高の自動更新は継続します。「ApiMonitor を終了」を選んだ場合のみアプリは完全に終了します。
zh_cn: 隐藏到通知区域后，余额自动刷新将继续运行。选择“退出 ApiMonitor”才会完全结束程序。

# Settings.ExitApplication.Content
source: Exit ApiMonitor
ja_jp: ApiMonitor を終了
zh_cn: 退出 ApiMonitor

# Settings.CloseBehavior.Text
source: When closing the main window:
ja_jp: メインウィンドウを閉じるとき：
zh_cn: 关闭主窗口时：

# Settings.StartWithWindows.Header
source: Start ApiMonitor when I sign in to Windows
ja_jp: Windows へのサインイン時に ApiMonitor を起動
zh_cn: 登录 Windows 时启动 ApiMonitor

# Settings.NotificationSection.Text
source: Balance alerts
ja_jp: 残高アラート
zh_cn: 余额提醒

# Settings.EnableNotifications.Header
source: Enable balance system notifications
ja_jp: 残高のシステム通知を有効にする
zh_cn: 启用余额系统提醒

# Settings.RepeatInterval.Text
source: Default repeat alert interval
ja_jp: 既定の繰り返しアラート間隔
zh_cn: 默认重复提醒间隔

# Settings.RecoveryNotifications.Header
source: Balance recovery notifications
ja_jp: 残高回復通知
zh_cn: 余额恢复提醒

# Settings.SendTestNotification.Content
source: Send test notification
ja_jp: テスト通知を送信
zh_cn: 发送测试通知

# Settings.OpenNotificationSettings.Content
source: Open Windows notification settings
ja_jp: Windows の通知設定を開く
zh_cn: 打开 Windows 通知设置

# Settings.AppearanceSection.Text
source: Appearance and language
ja_jp: 外観と言語
zh_cn: 外观与语言

# Settings.Theme.Text
source: Theme
ja_jp: テーマ
zh_cn: 主题

# Settings.Language.Text
source: Language
ja_jp: 言語
zh_cn: 语言

# Settings.AppearanceDescription.Text
source: Theme changes take effect immediately; language changes require an app restart.
ja_jp: テーマの変更はすぐに反映されます。言語の変更にはアプリの再起動が必要です。
zh_cn: 主题选择立即生效；语言更改需要重启应用。

# Settings.DataSection.Text
source: Data management
ja_jp: データ管理
zh_cn: 数据管理

# Settings.ExportBackup.Content
source: Export portable backup
ja_jp: ポータブルバックアップをエクスポート
zh_cn: 导出便携备份

# Settings.ImportBackup.Content
source: Import portable backup
ja_jp: ポータブルバックアップをインポート
zh_cn: 导入便携备份

# Settings.OpenDataFolder.Content
source: Open local data folder
ja_jp: ローカルデータフォルダーを開く
zh_cn: 打开本地数据文件夹

# Settings.AppInfoSection.Text
source: App information
ja_jp: アプリ情報
zh_cn: 应用信息

# Settings.GitHubLink.Content
source: GitHub repository
ja_jp: GitHub リポジトリ
zh_cn: GitHub 项目

# Settings.PrivacyLink.Content
source: Privacy policy
ja_jp: プライバシーポリシー
zh_cn: 隐私政策

# Settings.OnContent
source: On
ja_jp: オン
zh_cn: 开启

# Settings.OffContent
source: Off
ja_jp: オフ
zh_cn: 关闭

# Notification.RecoveredTitle
source: ApiMonitor: balance recovered
ja_jp: ApiMonitor：残高が回復しました
zh_cn: ApiMonitor：余额已恢复

# Notification.TestTitle
source: ApiMonitor: test notification
ja_jp: ApiMonitor：テスト通知
zh_cn: ApiMonitor：测试通知

# Notification.TestBody
source: This is a test notification. Click to open ApiMonitor.
ja_jp: これはテスト通知です。クリックすると ApiMonitor を開きます。
zh_cn: 这是一条测试通知。点击后打开 ApiMonitor。

# Notification.Snooze24h
source: Snooze alerts for 24 hours
ja_jp: アラートを 24 時間一時停止
zh_cn: 暂停提醒 24 小时

# About.ArchitectureFormat
source: Architecture: {0}
ja_jp: アーキテクチャ：{0}
zh_cn: 架构：{0}

# About.BackupExportFailed
source: Export backup failed. Please try again later.
ja_jp: バックアップのエクスポートに失敗しました。後でもう一度お試しください。
zh_cn: 导出备份失败，请稍后重试。

# About.BackupExported
source: Portable backup exported (no API keys).
ja_jp: ポータブルバックアップをエクスポートしました（API キーは含まれません）。
zh_cn: 便携备份已导出（不含 API Key）。

# About.BackupImportDone
source: Import complete: {0} added, {1} updated,
ja_jp: インポート完了：追加 {0}、更新 {1}、
zh_cn: 导入完成：新增 {0}、更新 {1}、

# About.BackupImportFailed
source: Import failed: {0} (changes rolled back).
ja_jp: インポートに失敗しました：{0}（変更はロールバックされました）。
zh_cn: 导入失败：{0}（已回滚本次变更）。

# About.BackupImportMerge
source: Import is a safe merge: existing accounts keep local credentials; new accounts need an API key re-entered.
ja_jp: インポートは安全なマージです。既存アカウントはローカル資格情報を保持し、新規アカウントは API キーの再入力が必要です。
zh_cn: 导入为安全合并，已有账户保留本机凭据；新账户需要重新输入 API Key。

# About.BackupImportNeedingKey
source: Accounts needing an API key: {0}
ja_jp: API キーの再入力が必要なアカウント：{0}
zh_cn: 以下账户需要重新输入 API Key：{0}

# About.BackupImportPreview
source: Backup can be imported: {0} accounts, {1} history entries.
ja_jp: バックアップをインポートできます：{0} アカウント、{1} 件の履歴。
zh_cn: 备份可导入：{0} 个账户、{1} 条历史。

# About.BackupImportSkipped
source: {0} skipped, {1} failed.
ja_jp: {0} スキップ、{1} 失敗。
zh_cn: 跳过 {0}、失败 {1}。

# About.CurrentLanguageFormat
source: Current UI language: {0}
ja_jp: 現在の UI 言語：{0}
zh_cn: 当前 UI 语言：{0}

# About.CurrentThemeFormat
source: Current theme: {0}
ja_jp: 現在のテーマ：{0}
zh_cn: 当前主题：{0}

# About.DiagnosticsCopyFailed
source: Failed to copy diagnostics.
ja_jp: 診断情報のコピーに失敗しました。
zh_cn: 复制诊断信息失败。

# About.DisplayVersionFormat
source: Version: v{0}
ja_jp: バージョン：v{0}
zh_cn: 版本：v{0}

# About.LinkIssuesTitle
source: Report an issue
ja_jp: 問題を報告
zh_cn: 提交问题

# About.LinkPrivacyTitle
source: Privacy policy
ja_jp: プライバシーポリシー
zh_cn: 隐私政策

# About.LinkRepositoryTitle
source: GitHub repository
ja_jp: GitHub リポジトリ
zh_cn: GitHub 仓库

# About.LinkSecurityTitle
source: Security policy
ja_jp: セキュリティポリシー
zh_cn: 安全政策

# About.LinkSupportTitle
source: Support documentation
ja_jp: サポートドキュメント
zh_cn: 支持文档

# About.LinkThirdPartyTitle
source: Third-party notices
ja_jp: サードパーティ製の声明
zh_cn: 第三方声明

# About.OpenDataFolderFailed
source: Unable to open the local data folder.
ja_jp: ローカルデータフォルダーを開けませんでした。
zh_cn: 无法打开本地数据文件夹。

# About.PackageIdentityFormat
source: Package Identity: {0}
ja_jp: パッケージ ID：{0}

# About.PackageVersionFormat
source: Package version: {0}
ja_jp: パッケージバージョン：{0}
zh_cn: 包版本：{0}

# About.ProviderCountFormat
source: Provider count: {0}
ja_jp: 現在の Provider 数：{0}
zh_cn: 当前 Provider 数量：{0}

# About.PublisherFormat
source: Publisher: {0}
ja_jp: 発行元：{0}
zh_cn: 发布者：{0}

# About.TaglineText
source: Monitor API balances, credits, credential status, and map/GIS service health locally
ja_jp: API 残高・クレジット・認証情報・地図/GIS サービスの健全性をローカルで監視

# About.UpdateAvailableFormat
source: A new version v{0} is available.
ja_jp: 新しいバージョン v{0} があります。
zh_cn: 发现新版本 v{0}。

# About.UpdateCheckFailedFormat
source: Update check failed: {0}
ja_jp: 更新の確認に失敗しました：{0}
zh_cn: 检查更新失败：{0}

# Home.PrivacyMessageText
source: API keys are stored in the Windows Credential Locker and are only used to call the provider official API; plain configuration and balance snapshots are stored only in the local app data directory.
ja_jp: API キーは Windows の資格情報ロッカー（Credential Locker）に保存され、対応する Provider の公式 API への要求にのみ使用されます。通常の設定と残高スナップショットはローカルのアプリデータのみに保存されます。
zh_cn: API Key 保存在 Windows 安全凭据存储（Credential Locker）中，只用于请求对应 Provider 的官方接口；普通配置和余额快照仅保存在本机应用数据目录。

# Home.AccountSummaryFormat
source: {0} accounts · {1} low balance · {2} query failed
ja_jp: 合計 {0} アカウント · 残高不足 {1} · 照会失敗 {2}
zh_cn: 共 {0} 个账户 · 低余额 {1} · 查询失败 {2}

# Home.SnoozeUntilFormat
source: Alerts paused until {0}
ja_jp: {0} までアラート一時停止
zh_cn: 暂停提醒至 {0}
